In [18]:
#1 insistent format issue with date format etc
#2 insistent naming means usa united states ik cheez alag alag lekhi ho
#3 Typographical error mistake in data entry
#4 duplication
#5 contradictory data father humesha bhety sy bara agar yh na ho tw logical true ni

In [19]:
import pandas as pd
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)

In [20]:
df

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [21]:
df['date']=pd.to_datetime(df['date'],errors='coerce')
df['date']=df['date'].dt.strftime('%d-%m-%Y')
df

         date        country    name  sales_2020  sales_2021
0  01-12-2021            USA  Aammar       100.0         NaN
1         NaN         U.S.A.   Amaar       200.0       150.0
2         NaN        America   Hamza         NaN       300.0
3         NaN  United States   Hazma       200.0       150.0

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1 non-null      object
 1   country     4 non-null      object
 2   name        4 non-null      object
 3   sales_2020  3 non-null      float64
 4   sales_2021  3 non-null      float64
dtypes: float64(2), object(3)
memory usage: 292.0+ bytes

In [23]:
df['country']=df['country'].replace({"USA":"United States","U.S.A.":"United States","America":"United States"})

In [24]:
df['name']=df['name'].replace({'Amaar':"Aammar","Hazma":"Hamza"})

In [25]:
df

         date        country    name  sales_2020  sales_2021
0  01-12-2021  United States  Aammar       100.0         NaN
1         NaN  United States  Aammar       200.0       150.0
2         NaN  United States   Hamza         NaN       300.0
3         NaN  United States   Hamza       200.0       150.0

In [26]:
df=df.drop_duplicates(subset='name')
df

         date        country    name  sales_2020  sales_2021
0  01-12-2021  United States  Aammar       100.0         NaN
2         NaN  United States   Hamza         NaN       300.0

In [27]:
df['sales_2020']=df['sales_2020'].ffill()
df['sales_2021']=df['sales_2021'].bfill()
df

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_11092\2477237260.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['sales_2020']=df['sales_2020'].ffill()
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_11092\2477237260.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['sales_2021']=df['sales_2021'].bfill()

         date        country    name  sales_2020  sales_2021
0  01-12-2021  United States  Aammar       100.0       300.0
2         NaN  United States   Hamza       100.0       300.0

In [28]:
df=df[df['sales_2020']<df['sales_2021']]
df

         date        country    name  sales_2020  sales_2021
0  01-12-2021  United States  Aammar       100.0       300.0
2         NaN  United States   Hamza       100.0       300.0